In [2]:
import sqlite3

conn = sqlite3.connect('books.db')
cur = conn.cursor()

In [10]:
def get_rows(sql, data):
    global conn
    global cur
    cur.execute(sql, data)
    rows = cur.fetchall()
    for ID, title, price, rate, cat_id in rows:
        print(f"[{ID}] ----- {title} ----- {price} £----- {rate} ----- Cat_id: {cat_id}")

*Books that has rate >=3 and has 'Mr' in its name*

In [6]:
get_rows("SELECT * FROM books WHERE rate >= ? AND title LIKE ?", [3, '%Mr%'])

*Books that has rate >=3 or price > 20*

In [ ]:
get_rows("SELECT * FROM books WHERE rate >= ? OR price > ?", [3,20])

*Books that has rate not 3*

In [ ]:
get_rows("SELECT * FROM books WHERE rate != ?", [3])

*Books that has price between 10 and 40 and has rate 3 or 4 or 1*

In [ ]:
get_rows("SELECT * FROM books WHERE rate IN (?,?,?) AND price BETWEEN ? AND ?",[3, 4, 1, 10, 40])

*The top 5 most expensive books (order books desc with price column and then limit the result to the first 5)*

In [ ]:
get_rows("SELECT * FROM books ORDER BY price DESC LIMIT 5", [])

*The 3rd 10 books in the books table order first by rate desc and then by price asc*

In [ ]:
get_rows("SELECT * FROM books ORDER BY rate DESC, price ASC LIMIT 10 OFFSET 3", [])

*A new category in categories table and add 5 books to this category in books table with title, rate and price*

In [11]:
cur.execute("INSERT INTO categories (name) VALUES (?)", ['Programming'])
conn.commit()
book_id = cur.lastrowid
for i in range(5):
    cur.execute("INSERT INTO books (title,price,rate,category_id) VALUES (?,?,?,?)", [f'Book-{i}', i + 20, i+1, book_id])
    conn.commit()

*updating book's rate to 3 that thier price < 20*

In [3]:
cur.execute("UPDATE books SET rate=? WHERE Price < ?", [3, 20])
conn.commit()

*Deleting all books that have price > 50£ and has rate <= 2*

In [ ]:
cur.execute("DELETE FROM books WHERE price > ? AND rate <= ?", [50, 2])
conn.commit()

*Counting the number of books that have 'Secret' in thier names and price between 10£ and 25£*

In [ ]:
cur.execute("SELECT COUNT(id) FROM books WHERE title LIKE ? AND price BETWEEN ? AND ?", ['%Secret%', 10, 25])
rows = cur.fetchall()
print(rows[0][0])

Getting the minimum & maximum price for all the books that have rate 5

In [ ]:
cur.execute("SELECT MAX(price) FROM books WHERE rate = ?", [5])
rows = cur.fetchall()
print(rows[0][0])

*Calculating the avg price for all the books that have rate 5*

In [3]:
cur.execute("SELECT AVG(price) FROM books WHERE rate = ?", [5])
rows = cur.fetchall()
print(rows[0][0])

*Sum all book's price that have rate 2 and price between 10 and 40*

In [ ]:
cur.execute("SELECT SUM(price) FROM books WHERE rate = ? AND price BETWEEN ? AND ?", [2, 10, 40])
rows = cur.fetchall()
print(rows[0][0])

*Joining both books & categories table into one new table containing book_name & category_name & book_rate and book_price*

In [ ]:
cur.execute("SELECT books.title,books.rate,categories.name FROM books INNER JOIN categories WHERE books.category_id = categories.id", [])
rows = cur.fetchall()
print(rows)

*Calculating how many books each rate has and have price between 20£ and 30£*

In [ ]:
cur.execute("SELECT COUNT(id), rate FROM books WHERE price BETWEEN ? AND ? GROUP BY rate", [20, 30])
rows = cur.fetchall()
print(rows)

*Calculating how many books each category has having count > 10*

In [ ]:
cur.execute("SELECT COUNT(id) AS CNT, category_id FROM books GROUP BY category_id HAVING CNT > ?", [10])
rows = cur.fetchall()
print(rows)

*get all books with category_name='Music' using subquery*

In [ ]:
cur.execute("SELECT * FROM categories WHERE name = ?", ['Music'])
rows = cur.fetchall()
print(rows)